package by.htp.homework.first;

public class Task07 {
	
	// Дан прямоугольник, ширина которого в два раза меньше длины. 
	// Найти площадь прямоугольника
	
	public static void main(String[] args) {
		
		int length;
		int width;
		int square;
		
		length = 6;
		
		width = length / 2;
		
		square = length * width;
		
		System.out.println("S = " + square);
		
	}
}
